app/controllers/api/partners_controller.rb

SELECT "partners".* FROM "partners" WHERE "partners"."active" = $1  [["active", true]]
---
  def index
    cached_partners = Rails.cache.fetch('active_partners') do
      partners = Partner.where(active: true)

SELECT "partners".* FROM "partners" WHERE "partners"."active" = $1  [["active", true]]
SELECT "partners".* FROM "partners"
---
  def active_partners
    parameter = params[:parameter]
    partners = Partner.where(active: true, parameter: parameter)

    partners_array = partners.map do |partner|

SELECT "partners".* FROM "partners"
---
  def find_partner(order_data)
    partner_parameter = order_data[:note_attributes]&.find { |na| na[:name] == 'Partner Parameter' }&.dig(:value)