app/controllers/api/partners_controller.rb

SELECT "week_days_times".* FROM "week_days_times"
---
  def day_times
    @partners = WeekDaysTime.all